UT23dev.РасширениеТорговыйЗалИКасса/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c285371e-3f47-40b7-ae0f-80022d7c7f9a">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="b2fcb9f1-74b9-4132-8cd3-86706882a07c">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РТЗ_Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="9420d966-d6d0-4421-839c-4edf4659bdba">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="22f09614-d101-4698-b308-1619118aca03">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f8229205-c76a-4f0b-b239-75ed26e27f5f">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="481a4939-4eff-41c7-b6fc-046deaa064ca">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b6d381d4-51f2-45c7-ad74-097108feb70a">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bb769e73-8734-4dd0-a1a3-67d1f09bce20">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d45bd4d-6938-4ccc-9fba-25b95a44c356">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ec541490-4b7e-4395-b808-cecfb4962523">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04f328d7-72dc-4bb0-a4a6-cade520a3668">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="58ce007e-4ca7-4c9d-8c90-b7db0421606d">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="200aee26-0a5f-489f-8c9b-d58f0b018615">
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="462c1711-48c8-4d8f-82f6-54bc4a1aab46">
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4e046569-838b-4e5e-9494-9338e05fc631">
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0fe5660f-6570-402b-9ec9-a6263db53427">
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="270dcb86-fab6-4f6f-849f-a454c7f6da13">
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="432ddf53-cbb7-4c93-9c45-42463b564afc">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4f4b0ee2-7458-47c2-819d-2ce749e378ec">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="71699a97-3ffd-482a-92bc-28bd2d608063">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6392944d-76b6-4efe-b9e3-a5b1881fafab">
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="da8764c1-3a54-42c6-a841-292cd9b151bf">
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f5958843-2d66-4ca0-ac2b-1993a900a6f7">
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="be7dc8a0-5a02-4a0e-af99-c290a81309c5">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e3143348-4b6e-4f30-9d3b-a5d8bb6ac36b">
      <name>СкидкаНаценка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1e759792-096b-4565-830f-86e066287c35">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="78378c8f-b66f-49a5-ba2d-b43ad87df0cb">
      <name>НапомнитьПозже</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT23dev.РасширениеТорговыйЗалИКасса/src/CommonModules/РТЗ_ТорговыеНакладныеКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

#Если Сервер Тогда

// Сформировать накладные по складам чек ККМ.
// 
// Параметры:
//  Документ - ДокументСсылка.ЧекККМ
// Возвращаемое значение:
//  ТаблицаЗначений - Сформировать накладные по складам чек ККМ:
// * Склад - СправочникСсылка.Склады - Склад на который необходимо сформировать накладную
// * Товар - ТаблицаЗначений - ТаблицаЗначений с Товаром по данному складу (Номенклатура,Количество,Упаковки)
Функция СформироватьНакладныеПоСкладамЧекККМ(Документ) Экспорт
	
	Если Документ = Документы.ЧекККМ.ПустаяСсылка() Тогда
		ВызватьИсключение "Передана пустая ссылка";
	Иначе
		Документ = Документ.ПолучитьОбъект();
	КонецЕсли;
	
	Склады = Новый Массив; //Массив для ведения складов для вывода
	
	Для Каждого СтрокаДокумента Из Документ.Товары Цикл
		
		Если Не ЗначениеЗаполнено(Склады.Найти(СтрокаДокумента.РТЗ_Склад)) Тогда
			Склад = СтрокаДокумента.РТЗ_Склад.ПолучитьОбъект();
			
			Если Склад.РТЗ_ЭтоТорговыйЗал И Не Склад.РТЗ_НеПропускатьПриФормированииНакладных Тогда
				Склады.Добавить(СтрокаДокумента.РТЗ_Склад);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	ТаблицаРезультат = ПолучитьКопиюТаблицыЗначенийРезультат();
	
	Для Каждого СкладСсылка Из Склады Цикл
		
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		СтрокаРезультат.Товар = ПолучитьКопиюТаблицыЗначенийНоменклатурыДляРезультата();
		СтрокаРезультат.Склад = СкладСсылка;
		
		Для Каждого СтрокаДокумента Из Документ.Товары Цикл
			СтрокаТовар = СтрокаРезультат.Товар.Добавить();
			
			Если СтрокаДокумента.РТЗ_Склад = СкладСсылка Тогда
				СтрокаТовар.Номенклатура = СтрокаДокумента.Номенклатура;
				СтрокаТовар.Количество = СтрокаДокумента.КоличествоУпаковок;
				СтрокаТовар.Упаковка = СтрокаДокумента.Упаковка;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецЕсли

#Если Клиент Тогда
	
//Todo: Процедура
	
#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Тогда

// Получить шаблон таблицы значений номенклатуры.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить шаблон таблицы значений номенклатуры:
// * Номенклатура - СправочникСсылка.Номенклатура -
// * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения -
// * Количество - Число -
Функция ПолучитьКопиюТаблицыЗначенийНоменклатурыДляРезультата()
	
	ТаблицаТовар = Новый ТаблицаЗначений();
	
	ТаблицаТовар.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТовар.Колонки.Добавить("Упаковка",     Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаТовар.Колонки.Добавить("Количество",   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19, 3, ДопустимыйЗнак.Неотрицательный)));
	
	Возврат ТаблицаТовар;
	
КонецФункции

// Получить шаблон таблицы значений результат.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить шаблон таблицы значений результат:
// * Склад - СправочникСсылка.Склады -
// * Товар - ТаблицаЗначений -
Функция ПолучитьКопиюТаблицыЗначенийРезультат()
	
	ТаблицаРезультат = Новый ТаблицаЗначений();
	
	ТаблицаРезультат.Колонки.Добавить("Склад",    Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаРезультат.Колонки.Добавить("Товар",    Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецЕсли

#КонецОбласти
